{"schedule": {"version": "0.6", "base_url": "https://speak.protocol.berlin/protocol-berg/schedule/", "conference": {"acronym": "protocol-berg", "title": "Protocol Berg", "start": "2023-09-15", "end": "2023-09-15", "daysCount": 1, "timeslot_duration": "00:05", "time_zone_name": "Europe/Berlin", "rooms": [{"name": "Magazin - Main Stage", "guid": "cad228f7-ffd0-4ef5-a920-be0800d1b292", "description": "The main stage located on the ground floor in the big, bright magazine of the bakery.", "capacity": 350}, {"name": "Atelier - Side Stage", "guid": "66cbeeb9-e485-4078-85cc-cabc3768d537", "description": "The side stage on the second floor above the magazine, all the way to the top.", "capacity": 150}, {"name": "Loft - Workshop 0", "guid": "47c52da9-5c17-49df-b7ec-1c599a5ef0a5", "description": "The workshop room 0 on the first floor above the magazine.", "capacity": 50}, {"name": "Atelier - Workshop 1", "guid": "4115564e-25d3-415e-80d8-0efe729decc9", "description": "The workshop room 1 on the second floor above the magazine.", "capacity": 50}], "days": [{"index": 1, "date": "2023-09-15", "day_start": "2023-09-15T04:00:00+02:00", "day_end": "2023-09-16T03:59:00+02:00", "rooms": {"Magazin - Main Stage": [{"id": 142, "guid": "9047579b-eb63-53cd-8b6a-7c3e0e1905d3", "logo": "", "date": "2023-09-15T09:00:00+02:00", "start": "09:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-142-opening-ceremony", "url": "https://speak.protocol.berlin/protocol-berg/talk/XHDAGB/", "title": "Opening Ceremony", "subtitle": "", "track": "General", "type": "Miscellaneous", "language": "en", "abstract": "The Department of Decentralization welcomes you to Protocol Berg!\r\n\r\nWe briefly run you through the concept of the event and the program highlights of the day. Furthermore, we share logistical and operational tips on how to navigate the venue, information on food and drinks, and more.", "description": "", "recording_license": "", "do_not_record": false, "persons": [{"id": 3, "code": "HHCRB3", "public_name": "Afri Schoedon", "biography": "Head of Protocol Engineering at ChainSafe Systems. Core-Organizer ETHBerlin, Protocol Berg, and GoerliCon. Running testnets on the side.", "answers": []}, {"id": 4, "code": "TJGCZ3", "public_name": "Franziska Heintel", "biography": "-", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 92, "guid": "5762900b-df3b-565e-836a-88b40ed0b405", "logo": "", "date": "2023-09-15T09:30:00+02:00", "start": "09:30", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-92-measuring-decentralization-across-l2-networks", "url": "https://speak.protocol.berlin/protocol-berg/talk/7VUT7E/", "title": "Measuring Decentralization Across L2 Networks", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "Many studies and analyses have been performed on Layer-1 protocols that measure decentralization to the point where we have an accepted set of standards. Such standards include, but are not limited to, nakamoto coefficient, validator distribution, and full node counts. This talk explores the challenges in measuring decentralization across layer-2s on Ethereum, Polkadot and Cosmos where the technology varies and creates new avenues of centralization more obscured from the view of users.", "description": "", "recording_license": "", "do_not_record": false, "persons": [{"id": 107, "code": "33FT3P", "public_name": "Asynchronous Phil", "biography": "A Berlin professional since 2013, focused on Bitcoin, Ethereum and Polkadot. Communications for Parity Technologies 2017-2022, now an independent contributor to Ethereum and Polkadot communications.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 95, "guid": "dd09dad1-ba65-5eac-a64e-47d19b2783d0", "logo": "/media/protocol-berg/submissions/KFJEFA/andy_tUK2FD6.jpg", "date": "2023-09-15T10:00:00+02:00", "start": "10:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-95-idk-what-x-is-and-at-this-point-i-m-afraid-to-ask", "url": "https://speak.protocol.berlin/protocol-berg/talk/KFJEFA/", "title": "idk what x is and at this point i'm afraid to ask", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "together we will speed run the definitions of the terms that you've heard but would hate for someone to ask you to define on a podcast.", "description": "we'll go as fast as we can giving up to date working definitions and possibly examples of things like: AA, intents, MEV, suave, appchain, rollup, data availability, zk circuit, stark, snark, modular, monolith, 4337, proxy, custodian, mesh security, shared sequencers\r\nthis talk will contain technical topics but should be suitable for all curious audiences.", "recording_license": "", "do_not_record": false, "persons": [{"id": 109, "code": "WFUZKD", "public_name": "Jenny Pollack", "biography": "jenny is an engineer turned product leader and a long time believer in decentralized applications and the infrastructure and communities that form them", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 19, "guid": "be34b829-453a-5f00-aed2-aedad075b64f", "logo": "/media/protocol-berg/submissions/CUAMSQ/profil_NsxZE2t.jpeg", "date": "2023-09-15T10:30:00+02:00", "start": "10:30", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-19-verkle-sync-bring-a-node-up-in-minutes", "url": "https://speak.protocol.berlin/protocol-berg/talk/CUAMSQ/", "title": "Verkle sync : bring a node up in minutes", "subtitle": "", "track": "Networking", "type": "Presentation: Standard", "language": "en", "abstract": "A high-level introduction to verkle sync, a synchronization algorithm made possible by the use of verkle trees and stateless Ethereum.", "description": "This presentation covers the internal of verkle sync from the point of view of the attester and/or hobbyist, and proposes a separation between attesters and block proposers. It details why running a node will become much easier, for some purposes, once verkle trees are in use.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 23, "code": "VTRV78", "public_name": "Guillaume Ballet", "biography": "Core developer, member of the geth team. I focus on evolutions to the protocol, and bringing research ideas to fruition.", "answers": []}, {"id": 159, "code": "PKCUY3", "public_name": "Tanishq Jasoria", "biography": "-", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 135, "guid": "61927df5-69c3-5b83-b094-7df3f9cf065d", "logo": "", "date": "2023-09-15T11:00:00+02:00", "start": "11:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-135-powdr-a-modular-stack-for-zkvms", "url": "https://speak.protocol.berlin/protocol-berg/talk/KZW7BJ/", "title": "powdr - a modular stack for zkVMs", "subtitle": "", "track": "Cryptography", "type": "Presentation: Standard", "language": "en", "abstract": "In the recent months, there has been a surge in the popularity of zkVM implementations. Many of these use specialized solutions and code, sometimes even all the way down to the cryptography, which makes these zkVMs very monolithic and non-interoperable.\r\n\r\nPowdr takes a modular approach to designing and constructing zkVMs, employing multiple compilation and optimization stages to arrive at the final prover and verifier. Users can define custom instruction sets for a VM, specify how those compile to constraints, generate sub-machines and declare how to connect them. Moreover, the flexibility of powdr enables users to select from a variety of proving backends when generating the prover and verifier components.\r\n\r\nTo validate this concept, we have successfully developed a fully functional verifier that compiles (no-std) Rust code into eSTARK and Halo2 proofs via the RISC-V architecture. Additionally, we are currently working on adapting this verifier to wasm and Valida, VMs that take very different architectural approaches than RISC-V.", "description": "<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 151, "code": "PFG78A", "public_name": "Christian Reitwiessner", "biography": "Christian Reitwiessner is widely recognized for his substantial contributions to the Ethereum ecosystem, mainly for developing the smart contract language Solidity and improvements to the Ethereum Virtual Machine. Recently, his focus lies in advancing zero-knowledge technologies, particularly through his work on the powdr project.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 134, "guid": "fb4ad982-69f3-58ad-9d58-1ad2bf282d2d", "logo": "", "date": "2023-09-15T11:30:00+02:00", "start": "11:30", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-134-will-your-crypto-project-be-censored-philosophy-and-practice-of-censorship", "url": "https://speak.protocol.berlin/protocol-berg/talk/9EFBHF/", "title": "Will your crypto project be censored? Philosophy and practice of censorship", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "Will your crypto project be censored? Censorship is spreading, from Infura blocking IP addresses, to Github taking the Tornado Cash repo down. This talk will provide a legal anthropological analysis of the elements that might put a project at risk, so that you can take the necessary steps to protect your efforts", "description": "In this talk we want to examine the human and legal elements behind censorship at infrastructure level in order to know how to prevent your project being shut down by governments and/or infrastructure players", "recording_license": "", "do_not_record": false, "persons": [{"id": 150, "code": "9WX3KE", "public_name": "Costanza Gallo", "biography": "I work for the Swarm Foundation where I recently led the project Wikipedia on Swarm, to make a web3 censorship resistant copy of Wikipedia. Prior to that, I was community manager with the Golem Network. I have a MSc in Law, Anthropology and Society from the London School of Economics, where I focused on the interplay between State Secrecy and Democratic Governance. But my passion for freedom of speech goes way back: my father was a satirical cartoonist and a political journalist, he was often the target of censorship attempts so it’s a family affair.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 74, "guid": "614d201f-32ab-5a57-80db-3a622311751c", "logo": "", "date": "2023-09-15T12:00:00+02:00", "start": "12:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-74-polkadot-parachain-consensus", "url": "https://speak.protocol.berlin/protocol-berg/talk/NNRSTM/", "title": "Polkadot Parachain Consensus", "subtitle": "", "track": "Consensus", "type": "Presentation: Standard", "language": "en", "abstract": "Polkadot Parachain Consensus went live in December 2021. What is it? How does it work? How does it compare to scaling solutions on Ethereum? Are parachains a rollup?", "description": "<tags>Polkadot</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 84, "code": "7MJ7NP", "public_name": "eskimor", "biography": "I am father of twins and a programmer. At the age of 15, I heard that ordinary people can actually program computers, I bought a 1200 page book about C++ and started learning. I sticked with C++ for quite a while, learned Java, went back to C++, learned D, Python, Haskell and eventually Rust. Then I became interested in peer-to-peer systems, experimented with rust-libp2p and found that blockchains could play a major role in mitigating shortcomings of p2p systems. So it happened that I applied at Parity Technologies as a core developer. At Parity Technologies I am driving and implementing major parts of Polkadot's Parachain consensus.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 61, "guid": "cc2c1b8d-c3ba-52c9-b99d-f7c85682dd26", "logo": "", "date": "2023-09-15T12:30:00+02:00", "start": "12:30", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-61-creating-a-browser-embedded-light-client-a-post-mortem", "url": "https://speak.protocol.berlin/protocol-berg/talk/LUWGAE/", "title": "Creating a browser-embedded light client: a post-mortem", "subtitle": "", "track": "Networking", "type": "Presentation: Standard", "language": "en", "abstract": "Smoldot is a JavaScript package containing a light client for the Polkadot network, that can run from within a web page. Its development, which started nearly 4 years ago, was no easy feat. This talk is a post-modern that will go over the challenges that have been encountered and how we solved them.", "description": "Creating a light client that can run from within a web browser presents a lot of engineering challenges, ranging from connectivity to maintaining a low CPU profile. This talk will present all these challenges, explain all the technological choices that we made, and why we had to write a brand new client from scratch.\r\n<tags>Polkadot</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 72, "code": "LXJJJG", "public_name": "tomaka", "biography": "Pierre Krieger has been in the Rust ecosystem since 2014. After leading several popular open source repositories such as glutin, glium, vulkano, or redshirt, he joined Parity Technologies in 2017 where he led the networking team of Substrate (the framework Polkadot uses). He left Parity at the end of 2022 in order to focus on its work on a Substrate/Polkadot light client as a freelance.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 115, "guid": "dbcb75fa-ac67-513e-b3ec-b3caf7e1ea89", "logo": "/media/protocol-berg/submissions/PWTCNA/standards_ySTjhnl.png", "date": "2023-09-15T13:00:00+02:00", "start": "13:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-115-modular-interoperability-let-s-get-to-1-standard-before-there-are-15", "url": "https://speak.protocol.berlin/protocol-berg/talk/PWTCNA/", "title": "Modular Interoperability: let's get to 1 standard, before there are 15", "subtitle": "", "track": "Networking", "type": "Presentation: Standard", "language": "en", "abstract": "Charly and Susannah explain to you a modular framework for understanding and talking about interoperability, and try to convince you to participate in the creation of a single standard for one layer in this modular framework (hint: the corollary being TCP/IP)", "description": "<tags>interoperability</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 127, "code": "8XEDSC", "public_name": "Susannah Evans", "biography": "Susannah is the product lead for the IBC team at Interchain", "answers": []}, {"id": 130, "code": "DRD93C", "public_name": "Charleen Fei", "biography": "-", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 138, "guid": "9b0ed01d-0427-5c30-80a5-a9337941898f", "logo": "", "date": "2023-09-15T13:30:00+02:00", "start": "13:30", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-138-dynamic-ibc-the-new-wave-of-dapp-composability", "url": "https://speak.protocol.berlin/protocol-berg/talk/GEMJER/", "title": "Dynamic IBC: the new wave of dApp composability", "subtitle": "", "track": "Infrastructure", "type": "Presentation: Standard", "language": "en", "abstract": "Until now, interoperable applications using IBC could only be built by launching your own chain on Cosmos. The new Dynamic IBC (dIBC) creates new possibilities for smart contracts to create their own data packets and compose with other dApps and appchains to unlock a new battery of use cases in web3.", "description": "<tags>Cosmos</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 25, "code": "NUWLD7", "public_name": "Federico Kunze Küllmer", "biography": "Evmos Co-founder. Cosmos Core Contributor. IBC Core Engineer.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 144, "guid": "591b9442-69e7-5559-a36a-11daf44e99b0", "logo": "", "date": "2023-09-15T14:30:00+02:00", "start": "14:30", "duration": "00:50", "room": "Magazin - Main Stage", "slug": "protocol-berg-144-agile-coretime-a-periodic-sale-based-method-for-assigning-polkadot-coretime", "url": "https://speak.protocol.berlin/protocol-berg/talk/JNBDLT/", "title": "Agile Coretime: A Periodic, Sale-based Method for Assigning Polkadot Coretime", "subtitle": "", "track": "Consensus", "type": "Presentation: Keynote", "language": "en", "abstract": "The \"Polkadot Ubiquitous Computer\" (or just Polkadot UC), represents the public service provided by the Polkadot Network: it is a trust-free, WebAssembly-based, multicore, internet-native omnipresent virtual machine which is highly resilient to interference and corruption. The present system of allocating resources of the Polkadot Ubiquitous Computer (parachain slot auctions) is based on a model of one-core-per-parachain: this is a legacy interpretation of the Polkadot platform and is not a reflection of its present capabilities. With Polkadot's capability to adapt to its users'need, a new paradign for allocating coretime is being implemented by ecosystem teams. Coretime on the Polkadot UC is envisioned to be sold by the Polkadot System in two separate formats: Bulk Coretime and Instantaneous Coretime. When a Polkadot Core is utilized, we say it is dedicated to a \"Task\" rather than a \"parachain\". The Task to which a Core is dedicated may change at every Relay-chain block and while one predominant type of Task is to secure a Cumulus-based blockchain (i.e. a parachain), other types of Tasks are envisioned. Bulk Coretime is sold periodically on a specialised system chain known as the \"Coretime-chain\" and allocated in advance of its usage, whereas Instantaneous Coretime is sold on the Relay-chain immediately prior to usage on a block-by-block basis.\r\n\r\nThis talk aims to explain this paradigm change within the Polkadot community to adapt to end-user needs, provide more agility and reduce long-term design flows.", "description": "<tags>Polkadot</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 172, "code": "WBQUWB", "public_name": "Gavin Wood", "biography": "-", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 55, "guid": "9d055f5d-0a23-55b1-b2f0-c0edd3a89321", "logo": "/media/protocol-berg/submissions/PZ37T7/CleanShot_2023-05-25_at_03.52.022x_X9fVsKB.png", "date": "2023-09-15T15:30:00+02:00", "start": "15:30", "duration": "00:50", "room": "Magazin - Main Stage", "slug": "protocol-berg-55-interplanetary-consensus-scaling-the-open-data-economy", "url": "https://speak.protocol.berlin/protocol-berg/talk/PZ37T7/", "title": "InterPlanetary Consensus: Scaling the open data economy", "subtitle": "", "track": "Consensus", "type": "Presentation: Keynote", "language": "en", "abstract": "Consensus poses a major scalability bottleneck in blockchain networks - hampering web-scale applications like Twitch, Twitter, Tiktok, or web3 alternatives to scale within web3. Interplanetary Consensus (IPC) is a new framework to enable on-demand horizontal scalability of Filecoin to meet web-scale application demands - unlocking an open data economy of composable subnets for scalable computation, fast data retrievals, application-specific gaming networks, and more on the Filecoin network.", "description": "IPC unlocks deploying subnets (self-governing chains) that spawn their own state, validate messages in parallel, and seamlessly interact with any network in the hierarchy, as well as with the Filecoin root network. Subnets can run different consensus algorithms, depending on application requirements.\r\n\r\nIPC builds upon the Filecoin Virtual Machine launched in March 2023 - providing a framework to further program the Filecoin network, accommodating a variety of use cases while overcoming potential consensus bottlenecks, to load balance decentralised applications by spawning new blockchain substrates on-demand, and to tailor the system to better fit application needs. If you're interested in bringing IPC+FVM to your network - get in touch!\r\n<tags>Filecoin</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 68, "code": "U8AJFX", "public_name": "Molly Mackinlay", "biography": "Molly Mackinlay leads Engineering and Research Development at Protocol Labs. This includes OSS stewardship across IPFS, Filecoin, and libp2p; designing and managing new breakthroughs like the Filecoin Virtual Machine (FVM); and helping launch new networks like Saturn (web3 CDN) and IPC (L2 subnets). Her work at PL also involves past roles as IPFS Project Lead and launching the Filecoin mainnet. She started her career as an (A)PM at Google after graduating from Stanford.\r\n\r\nMolly also created PL Launchpad, a four-week web3 onboarding program designed to train, develop, and connect technical talent with collaborators and web3 knowledge across the Protocol Labs Network (PLN). If you’re looking for the knowledge and community to ramp into web3 - get in touch!", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 17, "guid": "9eee71d2-982b-5b30-b8b2-8af14ba9e87f", "logo": "", "date": "2023-09-15T16:30:00+02:00", "start": "16:30", "duration": "01:20", "room": "Magazin - Main Stage", "slug": "protocol-berg-17-the-blockspace-expo", "url": "https://speak.protocol.berlin/protocol-berg/talk/G7Z33N/", "title": "The Blockspace Expo", "subtitle": "", "track": "Consensus", "type": "Workshop: Deep Dive", "language": "en", "abstract": "Protocol researchers and developers from distant ecosystems gather to talk about their blockspace.", "description": "We present a workshop centred around blockspace and its provision in four different ecosystems. Blockspace is the key resource supplied by blockchains, which allows users to transact. Considerable infrastructure has now seen the light of day towards refining blockspace and delivering more value across the stack, from users to the protocol. But blockspace is not an homogenous resource, being deeply tied with both the consensus protocols which supply it and the infrastructure which refines it. Comparing notes between ecosystems will allow us to uncover best practices and opportunities to learn from one another.\r\n\r\nOur workshop will feature researchers and developers from four different ecosystems, represented by:\r\n- [Robert Habermeier](https://twitter.com/rphmeier/status/1631467728555974658) (Polkadot)\r\n- [Sam Hart](https://twitter.com/SkipProtocol/status/1642895191857299458) (Skip Protocol)\r\n- [Jannik Luhn](https://twitter.com/project_shutter/status/1628430652990267393) (Shutter Network)\r\n- [Barnabé Monnot](https://twitter.com/barnabemonnot/status/1628836608270016517) (Robust Incentives Group @ Ethereum Foundation)\r\n\r\nEach speaker will present key facts about their blockspace, its design and its philosophy (4x 8mins each). After these opening remarks, we feature a panel moderated by [Christopher Goes](https://twitter.com/cwgoes) (Heliax) to dive into the deep questions (~40 mins). Expect resource pricing, MEV, base-layer encryption, composability and many other themes to be discussed!\r\n\r\n<tags>Cosmos, Ethereum, Polkadot, Gnosis</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 17, "code": "E3QQUM", "public_name": "Barnabé Monnot", "biography": "Barnabé Monnot is a research scientist for the Robust Incentives Group, a research team of the Ethereum Foundation dedicated to the study of cryptoeconomics and mechanism design.", "answers": []}, {"id": 36, "code": "3VUTST", "public_name": "Robert Habermeier", "biography": "-", "answers": []}, {"id": 41, "code": "3EJWPM", "public_name": "Jannik Luhn", "biography": "-", "answers": []}, {"id": 42, "code": "CLABRV", "public_name": "Sam Hart", "biography": "Sam is the Head of Product and Strategy at Skip, a team building MEV solutions that improve protocol sustainability and cross-chain UX. He is also Co-founder of Timewave, an organization that creates tools for intelligent on-chain resource allocation and trustless cooperation.", "answers": []}, {"id": 182, "code": "MEVNRW", "public_name": "Christopher Goes", "biography": "Christopher Goes currently works on Anoma and Namada. Previously, he worked on IBC and the Wyvern DEX protocol. He lives in Berlin.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 37, "guid": "8e87a435-bbff-5076-b02b-6ed6640bd7a0", "logo": "", "date": "2023-09-15T18:00:00+02:00", "start": "18:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-37-how-to-unleash-the-power-of-account-abstraction", "url": "https://speak.protocol.berlin/protocol-berg/talk/TPBSFA/", "title": "How to unleash the power of Account Abstraction", "subtitle": "", "track": "Infrastructure", "type": "Presentation: Standard", "language": "en", "abstract": "EIP-4337 gave some guidelines and visibility for Account Abstraction, but this is only the start. To fully unfold the power of smart contract based accounts it requires careful considerations and good standards. In this talk we want to give an overview on the current state of modular smart contract accounts and how to fully take advantage of the flexibility that comes with them.", "description": "Standards allow developers to group behind a common cause and push initiatives forward in a coordinated manner. For Smart Contract based accounts there are very few such standard in use up to this point, notably only ERC-1271 and ERC-4337. There are quite some initiatives around this topic by different teams which are worth taking a look at. In this session we will give an overview of the current state in this area and also outline how the Safe project is designing a protocol for this.\r\n\r\nThe following topics will be covered in this presentation:\r\n- Recap of current state of Account Abstraction: ERC-1271 and ERC-4337\r\n- The importance of standards for Account Abstraction\r\n- Unleash the power of Account Abstraction: Safe Protocol and ERC-6900\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 52, "code": "GQW3TN", "public_name": "Richard Meissner", "biography": "Richard Meissner is the co-founder of Safe with almost a decade of experience as a software engineer. He joined the Gnosis team in 2017 as the tech lead for Gnosis Safe. Working behind the scenes, Richard is setting security standards for Web3  by building the safest digital asset manager and expanding the possibilities of digital asset ownership. Richard is also a thought leader on account abstraction and what it enables for the future of web3.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 133, "guid": "31e03266-0c25-5e7f-b623-a882190799aa", "logo": "/media/protocol-berg/submissions/3N7PQL/220908-NCRP-DaemonDiscord-CodeIsLaw_pc9oLZa.png", "date": "2023-09-15T18:30:00+02:00", "start": "18:30", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-133--mis-adventures-in-governance", "url": "https://speak.protocol.berlin/protocol-berg/talk/3N7PQL/", "title": "(mis)adventures in governance", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "Eyewitness Reports from a Decade-Long Unaligned Bystander", "description": "In this presentation, I will draw upon ten years of interdisciplinary research into the social formations around protocol networks.", "recording_license": "", "do_not_record": false, "persons": [{"id": 149, "code": "JRNPPE", "public_name": "Wassim Z. Alsindi", "biography": "Wassim Z. Alsindi PhDWassim is the founder and creative director of the 0x Salon, which conducts experiments in post-disciplinary collective knowledge practices. A veteran of the timechain, Wassim specialises in conceptual design and philosophy of peer-to-peer systems, on which he writes, speaks, teaches, and consults. He has an editorial column at the MIT Computational Law Report, and he co-founded MIT’s Cryptoeconomic Systems journal and conference series. Wassim has curated arts festivals, led a sculptural engineering laboratory and published experimental music, satirical theatre, poetry, and speculative scripture. Wassim holds a Ph.D. in ultrafast supramolecular photophysics from the University of Nottingham.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 91, "guid": "41fbfbd1-740c-5e76-bd56-e7bf034a984c", "logo": "", "date": "2023-09-15T19:00:00+02:00", "start": "19:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-91-the-nature-of-the-protocol", "url": "https://speak.protocol.berlin/protocol-berg/talk/UMVLXR/", "title": "The Nature of the Protocol", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "Since 2019, we’ve been studying the novel dynamics unlocked by crypto protocols,  articulating new mentals model for understanding them, such as \"headless brands\" and \"squad wealth.\" Since our work on public goods and with our experience as researchers and builders, our thinking has taken a more deeply political turn as we consider the long-term impact of crypto protocols as institutional bodies.\r\n\r\nInstitutional legitimacy and accountability of actors are problems which recur time and again as critical themes in protocol development and operations. Attempts to solve these problems are very wide-ranging, drawing from notions of the state (DAO constitutionalism) to corporations (coin-voting shareholder governance). As a result, protocol work has become a byzantine maze of narratives and mismatched mental models which are often a poor fit for the technical affordances of blockchains.\r\n\r\nIn this keynote talk, we will share insights from 5 years of techno-cultural analysis in the crypto space. We'll then present several frameworks that reveal how accountability and legitimacy arise—or don't—in crypto protocols. Drawing from legal and political theory (featuring pirates), we'll share a political philosophy of crypto institutions that will help protocol stewards and core developers understand power, behavioral regulation, and even violence in the nature of the protocol.", "description": "", "recording_license": "", "do_not_record": false, "persons": [{"id": 106, "code": "CB9AL3", "public_name": "Toby Shorin", "biography": "Toby Shorin\r\nToby Shorin is a writer and technologist based in New York and the cofounder of Other Internet Research Institute. His research examines the moral genealogy of technological and cultural evolution.", "answers": []}, {"id": 132, "code": "XNTTX9", "public_name": "Laura Lotti", "biography": "Researcher at Other Internet investigating the institutional affordances of blockchain protocols", "answers": []}, {"id": 42, "code": "CLABRV", "public_name": "Sam Hart", "biography": "Sam is the Head of Product and Strategy at Skip, a team building MEV solutions that improve protocol sustainability and cross-chain UX. He is also Co-founder of Timewave, an organization that creates tools for intelligent on-chain resource allocation and trustless cooperation.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 143, "guid": "09d3853a-d983-5f74-9788-0ade9cc628e3", "logo": "", "date": "2023-09-15T19:30:00+02:00", "start": "19:30", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-143-closing-ceremony", "url": "https://speak.protocol.berlin/protocol-berg/talk/BRQBDN/", "title": "Closing Ceremony", "subtitle": "", "track": "General", "type": "Miscellaneous", "language": "en", "abstract": "In this session, we invite you to grab a closing drink and wrap up the day with us! Learn more about the motivation behind Protocol Berg: What led us to organize this event and why did we decide to set it up as a donation-backed, sponsorless, non-profit event that is free to attend?\r\n\r\nWe will share our thoughts on event content curation, sponsors, and ecosystem collaboration. We will create transparency over our expenditures and how this event was financed.\r\n\r\nWe will also touch on the hardships and experiences of organizing a donation-only event, purely brought to you by a group of volunteers, always keeping in mind our goal: putting the attendee experience and content quality first.", "description": "", "recording_license": "", "do_not_record": false, "persons": [{"id": 3, "code": "HHCRB3", "public_name": "Afri Schoedon", "biography": "Head of Protocol Engineering at ChainSafe Systems. Core-Organizer ETHBerlin, Protocol Berg, and GoerliCon. Running testnets on the side.", "answers": []}, {"id": 4, "code": "TJGCZ3", "public_name": "Franziska Heintel", "biography": "-", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 152, "guid": "020c2af5-6602-5630-84ec-fe82046c2c90", "logo": "", "date": "2023-09-15T20:00:00+02:00", "start": "20:00", "duration": "00:25", "room": "Magazin - Main Stage", "slug": "protocol-berg-152-post-conference-social-mixer", "url": "https://speak.protocol.berlin/protocol-berg/talk/EGZZDF/", "title": "Post-Conference Social Mixer", "subtitle": "", "track": "General", "type": "Miscellaneous", "language": "en", "abstract": "Grab a drink (choice of aperitif, beer, or lemonade on us!) and mingle with fellow attendees and speakers.", "description": "", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}], "Atelier - Side Stage": [{"id": 103, "guid": "50e093d3-7ccd-56ad-9e1f-515403709154", "logo": "/media/protocol-berg/submissions/99GGGB/Banner_Shot_6B16JUI.png", "date": "2023-09-15T10:00:00+02:00", "start": "10:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-103-indexing-ethereum-mainnet-for-near-zero-cost", "url": "https://speak.protocol.berlin/protocol-berg/talk/99GGGB/", "title": "Indexing Ethereum Mainnet for Near-Zero Cost", "subtitle": "", "track": "Infrastructure", "type": "Presentation: Standard", "language": "en", "abstract": "A discussion about EVM client software, why it can't deliver accurate transactional histories (hint: it's missing an index), and what it would be like if it could.", "description": "In this talk, we describe the Unchained Index: a system for creating a naturally-sharded, immutable index for any EVM-based blockchain including L2s.\r\n\r\nUsing only the node software as its data source, the Unchained Index visits every binary corner of the chain's history, searching for address appearances (which is way more complicated than one might think). The algorithm is well-documented and open source. This ensures that the process is permissionlessly reproducible. The result of this indexing is stored as a collection of chunks.\r\n\r\nBy building chunks (\"a time-ordered log of an index of a time-ordered log\"), fronting the chunks with Bloom filters, and maintaining a manifest of all chunks and Blooms, we create an off-chain index that lives naturally on content-address stores such as IPFS. We publish the hashes of all parts of the index to a smart contract.\r\n\r\nEnd users (by querying the Bloom filters via the smart contract) may download only that portion of the index that they are interested in (i.e., their own histories). This ensures that the system works on small machines. Using \"Pin by Default\" the system realizes the massive benefit of enlisting end users in the distribution of the chunks. Heavy users acquire, pin, and distribute a larger portion of the index than light users making the system \"naturally fair.\"\r\n\r\nAnd--because we've purposefully enlisted end-users in carrying the burden of the data, the cost of operation is near zero. Everyone shares the burden and reaps the benefits.\r\n\r\nWe're trying to build a true public good, and we wish the system to be sustainable. The only way for that to happen, we believe, is for the cost of the system to be very low.\r\n\r\nTrueBlocks is a two-time recipient of Ethereum Foundation grants, the recipient of a Moloch DAO grant, an IPFS grant, and more than 3,000 individual donations on the GitCoin grant platform. Our work is fully open-source and local first.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 96, "code": "37CFR8", "public_name": "Thomas Jay Rush", "biography": "Thomas Rush is the founder of TrueBlocks.io, a blockchain-focused consultancy and software company delivering fast, usable data from the blockchain. Rush is a two-time recipient of Ethereum Foundation grants, a Moloch DAO grant recipient, an active community member, and also the founder of the Philadelphia Ethereum Meetup group. In a former life, Rush taught undergraduate writing at the Community College of Philadelphia. Rush holds a Master of Fine Arts in Poetry from Rosemont College and a Master of Science in Computer Science from the University of Pennsylvania.", "answers": []}, {"id": 117, "code": "RKQMT3", "public_name": "Dawid Szlachta", "biography": "Dawid Szlachta is TrueBlocks’ lead developer. Before joining TrueBlocks, Szlachta spent eight years sharpening his skills on various large-scale web applications. However, he is now more interested in developing local-first and privacy friendly software powered by Ethereum and IPFS. He holds a bachelor’s degree in Philology from the University of Warsaw and lives with his wife in Kraków, Poland.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 44, "guid": "d19650cc-06d6-54f3-b338-37b5258277a1", "logo": "/media/protocol-berg/submissions/EEPMJU/Sunny_newww_mY1w5qy.png", "date": "2023-09-15T10:30:00+02:00", "start": "10:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-44-retroactive-public-goods-funding-2-rounds-in", "url": "https://speak.protocol.berlin/protocol-berg/talk/EEPMJU/", "title": "Retroactive Public Goods Funding: 2 Rounds in", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "In this talk I want to share about Retroactive Public Goods Funding, what we learned in running 2 rounds of RetroPGF at Optimism, and what's next on our journey to summon Ether's Phoenix 🕊️", "description": "Cyberspace today suffers from a monumental market failure because its economic ruleset was built for the physical world. Public Goods are core to the growth of cyberspace but our current markets are unable to nurture that growth. Web3 presents an opportunity for cyberspace to only be occupied but governed by its citizens and reinvent how we organize and fund public goods in this digital age\r\n\r\nOptimism is experimenting with a new economic mechanism called Retroactive Public Goods Funding, in which citizens reward the creation and maintenance of public goods proportional to how much impact these public goods provide to the collective.\r\n\r\nIn March ‘23, we concluded our second RetroPGF experiment, where 69 Badgeholders allocated 10M OP among 195 Projects. We learned a bunch. We're on to the next experiment with exciting new improvements. One step closer to Ethers Phoenix\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 59, "code": "B7LXZG", "public_name": "Jonas Seiferth", "biography": "RetroPGF lead @ Optimism Foundation\r\nOn a journey to summon Ether's Phoenix with a bunch of Optimists.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 30, "guid": "19fa426a-aa8a-5929-95fd-056f1221d58d", "logo": "/media/protocol-berg/submissions/HUC7BR/PG_RvQlz2E.jpg", "date": "2023-09-15T11:00:00+02:00", "start": "11:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-30-linux-ethereum-commoning-vs-commodifying", "url": "https://speak.protocol.berlin/protocol-berg/talk/HUC7BR/", "title": "Linux & Ethereum: Commoning vs Commodifying", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "This talk introduces the concept of digital commons, outlines some parallels between the Linux and Ethereum projects, and how their collective output may become enclosed by commercial entities.", "description": "Our lives today run on software, much of it \"open source.\" The combination of the software and the stewardship process by which it is produced create \"digital commons.\" This is a type of collectively managed resource that is difficult to constrain in access or usage due to some inherent properties. However, it is still possible for actors to enclose some of the commons production process and, as a result, influence the output.\r\n\r\nOver the past 30+ years, Linux has grown to be called “largest collaborative development project in the history of computing.” The result is a complex software artifact, the Kernel, and a wide diversity of extensions to the kernel: Distros. While some are community run, some are commercial operations. This profit incentive sometimes lead to strange entanglements of the commercial entities and the commons which they build on. This process of knowledge extraction for influence and profit is called \"enclosure.\"\r\n\r\nWhile Ethereum is 15 years younger, we can already see parallels between the two projects: commons-stewarded software and state extended by a burgeoning ecosystem of entities building novel mechanisms.\r\n\r\nCan we avoid some of the enclosure found in Linux? I make the case that extraction occurs as state production is commodified. To hedge against this happening too early, we should be clear-eyed about the encumbering stewardship process: who and what can participate, what the stewardship process looks like, and how it is funded. \r\n\r\nProtocol Guild is a commons-funding mechanism tailored to Ethereum protocol development. Over 150 individual peers collectively produce a weighted list of core protocol contributors, which enables the broader ecosystem to fund their work directly outside of encumbering commercial entities.\r\n \r\n- there is a typo in the title of the first slide (Commodifiying → Commodifying) \r\n- there is an error in the second slide (15 → 25)\r\n\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 181, "code": "N9BNME", "public_name": "Trent Van Epps", "biography": "Works at the Ethereum Foundation on protocol coordination. Member of the Protocol Guild", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 126, "guid": "08e18d17-bf50-589c-b9f9-17f1760fc66a", "logo": "", "date": "2023-09-15T11:30:00+02:00", "start": "11:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-126-decentralized-and-shared-sequencer-architecture", "url": "https://speak.protocol.berlin/protocol-berg/talk/TBMBHD/", "title": "Decentralized and Shared Sequencer Architecture", "subtitle": "", "track": "Consensus", "type": "Presentation: Standard", "language": "en", "abstract": "In this presentation, I'll go over the state of decentralized and shared sequencers for rollups, as well as existing and potential architectures for them. Decentralizing sequencers is needed for rollups to have true decentralization and censorship resistance, and sharing sequencers between rollups opens up the possibility of cross-rollup composability.", "description": "", "recording_license": "", "do_not_record": false, "persons": [{"id": 142, "code": "KUK7NG", "public_name": "elizabeth", "biography": "Elizabeth is a software engineer specializing in protocol-level development. Her interests include privacy, networking, and cryptography.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 9, "guid": "7c5ad0cc-230a-5479-ab57-89d457231ee7", "logo": "", "date": "2023-09-15T12:00:00+02:00", "start": "12:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-9-metadata-private-data-transfer", "url": "https://speak.protocol.berlin/protocol-berg/talk/Y7HNG9/", "title": "Metadata-private data transfer", "subtitle": "", "track": "Networking", "type": "Presentation: Standard", "language": "en", "abstract": "Metadata privacy is critical for personal and private data access. Today, mixnet-like systems are still the only privacy option for low latency data transfer that have been proven at scale. Other techniques are not far behind though, and can allow us to get similar or stronger privacy guarantees without sacrificing latency. I've advised a [funding program](https://research.protocol.ai/blog/2022/announcing-rfp-014-the-one-with-private-retrieval/) over the last year aimed at supporting the transition to practice of private retrieval. This talk will survey currently available systems, and our current guesses for what methods can scale to widespread adoption.", "description": "Last year, Protocol Labs launched a funding program for metadata-private data transfer. This program is rooted in the belief that a combination of cryptographic and systems techniques should be able to offer low latency private data transfer at scale. \r\n\r\nWe have worked with groups investigating paths by which PIR, Private set intersection, Multiparty Computation, trusted hardware, and homomorphic encryption can be applied to this problem. This talk will describe the state of the art, overhead costs, and promise of these various techniques.\r\n\r\nWe'll also look at ways in which the the problem can be relaxed. Traditionally, data transfer has focused on a web2 model of a single authoritative origin. Using content addressed data means both that integrity becomes much less of a problem, and allows data to be fetched from multiple remote locations. Incentivization is a useful primitive to unlink writers from readers by supporting a network intermediation layer. [Nym](https://nymtech.net/) has been a great example of the practicality of this mechanism, but it can be applied beyond mixnets as well.\r\n<tags>IPFS</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 9, "code": "VBLEQ9", "public_name": "Will Scott", "biography": "My work centers on how to make a more resilient web. To that end, I've worked on projects ranging from internet-wide measurement to privacy-protecting messaging systems. My current work at Protocol Labs is building a robust decentralized storage primitive.\r\n\r\nI've been a ski instructor, speak some chinese, and enjoy playing with fire. I taught computer science in pyongyang.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 8, "guid": "846ed10f-0889-5f58-948e-64bf8653a02b", "logo": "", "date": "2023-09-15T12:30:00+02:00", "start": "12:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-8-permanent-decentralized-storage-landscape-in-2023", "url": "https://speak.protocol.berlin/protocol-berg/talk/XNUYCW/", "title": "Permanent Decentralized Storage Landscape in 2023", "subtitle": "", "track": "Databases", "type": "Presentation: Standard", "language": "en", "abstract": "\"If a file isn't backed up, it isn't your file\" preceded \"Not your keys, not your crypto\", but it's important to look back to the Web1 figure of speech as it applies to Web3. If you have a multi-billion dollar protocol, it's a good idea to back it up. But where should one look to for this?", "description": "", "recording_license": "", "do_not_record": false, "persons": [{"id": 7, "code": "BBSUFV", "public_name": "Garrett MacDonald", "biography": "Long time contributor to the decentralized revolution. Student of physics.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 98, "guid": "8ae84850-a4ba-580a-a359-3f6627fe311a", "logo": "", "date": "2023-09-15T13:00:00+02:00", "start": "13:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-98-evolution-of-optimistic-rollup-proofs", "url": "https://speak.protocol.berlin/protocol-berg/talk/QZM8PM/", "title": "Evolution of Optimistic Rollup proofs", "subtitle": "", "track": "Consensus", "type": "Presentation: Standard", "language": "en", "abstract": "L2 Rollups are a core component of the Ethereum scaling strategy, and the security landscape is actively changing. This talk compares the different optimistic rollup proving methods, how EIP-4844 data-availability affects a proof, and how the proof itself can be designed with the latest L2 tech.", "description": "This talk is about proving methods, EIP-4844 proof support, and the latest R&D that includes a new bisection-game, pre-image oracle and proof VM (MIPS + experimental RISC-V). All open-source, open specs, and with future-compatibility for a multi-proof security approach: enabling L2 security improvements through the same principles as L1 client-diversity.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 112, "code": "99FQZ8", "public_name": "protolambda", "biography": "Protocol R&D at OP Labs, previously Eth2 researcher at EF. Working on Ethereum scaling, 4844, rollup security and blockchain architecture.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 118, "guid": "6f4cc1e9-6737-5255-82f6-c6fbc5f2fe03", "logo": "", "date": "2023-09-15T13:30:00+02:00", "start": "13:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-118-blockchain-node-db-designs-from-geth-to-erigon", "url": "https://speak.protocol.berlin/protocol-berg/talk/HSU7RW/", "title": "Blockchain node DB designs: from Geth to Erigon", "subtitle": "", "track": "Databases", "type": "Presentation: Standard", "language": "en", "abstract": "One of the definite feature of Erigon is how it stores blockchain state and state history in its own database. In this talk I will talk about the details, the database choices and the path the Erigon team took to go from the Geth data model into its own.", "description": "<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 134, "code": "F7H7ZF", "public_name": "Igor Mandrigin", "biography": "Igor is the CTO of [Gateway.fm](http://gateway.fm/), a builder with experience in all sides of the network stack, from browsers to large-scale cloud services. He has been deeply involved in blockchain, including being a core dev to the Ethereum (Erigon nodes) and serving as a researcher. \r\nAt Gateway.fm, Igor is currently working on building Gnosis Chain and setting up large-scale distributed infrastructure services as well as helping building zk Rollups nodes design for Polygon zkEVM.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 7, "guid": "93d1d19c-4aed-5829-b32a-a8f6b951cdfc", "logo": "", "date": "2023-09-15T14:00:00+02:00", "start": "14:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-7-testing-large-scale-networks-with-testground", "url": "https://speak.protocol.berlin/protocol-berg/talk/93DJFH/", "title": "Testing large scale networks with Testground", "subtitle": "", "track": "Infrastructure", "type": "Presentation: Standard", "language": "en", "abstract": "We will explore the features and benefits of Testground, and demonstrate how it can be used to test distributed systems in a controlled and reproducible environment at scale\r\n\r\nIn addition, we will cover test planning and strategies that worked for Celestia team that other protocol teams can take home as good point to start fresh", "description": "In this presentation, we will introduce Testground and its key features, including its modular architecture, flexible testing parameters, and support for multiple languages and testing frameworks. We will also demonstrate how Testground can be used to test and optimize large-scale distributed systems, such as peer-to-peer networks, mempool, consensus algorithms.\r\n\r\nFinally, we will discuss best practices for using Testground, including how to design effective test plans, how to interpret test results, and how to integrate Testground into existing testing workflows.Whether working on a client implementation or studying performance of the chain, Testground can help you test and validate systems at scale with different known telemetry/collection techniques and technologies\r\n<tags>Celestia</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 5, "code": "ETCZLB", "public_name": "Viet", "biography": "Big fan of why-how-what theory. \r\nTesting is my passion by day. Degening is by night. \r\nSometimes I get lucky shooting with my ASP-C Canon", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 63, "guid": "5589a3df-97c8-578e-ba43-83ea6de4df75", "logo": "/media/protocol-berg/submissions/BK9XJK/IMG_2476_l4ktP1C.jpg", "date": "2023-09-15T14:30:00+02:00", "start": "14:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-63-a-future-to-protocol-upgradability", "url": "https://speak.protocol.berlin/protocol-berg/talk/BK9XJK/", "title": "A Future to Protocol Upgradability", "subtitle": "", "track": "Governance & Society", "type": "Presentation: Standard", "language": "en", "abstract": "Discussing our current protocol upgradability governance practices (pausability, timelocks, emergency operational procedures) and how we can move towards more sustainable on-chain consensus-driven governance as a path to decentralized protocol governance.", "description": "<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 75, "code": "RHY8JQ", "public_name": "tina", "biography": "product at eigenlayer, previously fuel network and element finance (now delv tech).", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 96, "guid": "706bbea0-2b39-5147-9ee9-2e867716479f", "logo": "", "date": "2023-09-15T15:00:00+02:00", "start": "15:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-96-the-anoma-protocol-syntax-and-semantics", "url": "https://speak.protocol.berlin/protocol-berg/talk/7A3QSQ/", "title": "The Anoma Protocol: Syntax and Semantics", "subtitle": "", "track": "Networking", "type": "Presentation: Standard", "language": "en", "abstract": "This talk will give an introduction to the Anoma protocol architecture and its design goals, to share what we learned and elicit feedback on how we could improve both.\r\n\r\nAnoma is a distributed operating system for intent-centric counterparty discovery and privacy-preserving, scale invariant computation on linear and non-linear state resources with heterogenous trust assumptions.\r\n\r\nIn this talk, we'll shine a light on the separation of canonical protocol syntax necessary for global interaction and local semantics, especially in regards to trust.\r\n\r\nUnifying aspects of the protocol along specific dimensions enables us to make this line clearer and maximizes the options for semantic flexibility after deployment.", "description": "<tags>Anoma</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 110, "code": "YPRRQA", "public_name": "D.", "biography": "D. is a research engineer interested in distributed systems,  trust aware and privacy preserving computing, as well as applied mechanism design.\r\n\r\nThey are currently working on the anoma protocol specification and its prototypes.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 108, "guid": "66a5f0e7-2fd9-5969-944b-4118939a5b19", "logo": "", "date": "2023-09-15T15:30:00+02:00", "start": "15:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-108-recursive-snarks-for-efficiency-scalability-and-privacy", "url": "https://speak.protocol.berlin/protocol-berg/talk/PPPWRS/", "title": "Recursive SNARKs for Efficiency, Scalability, and Privacy", "subtitle": "", "track": "Cryptography", "type": "Presentation: Standard", "language": "en", "abstract": "Blockchains, with their primary focus on decentralization, open participation, and resilience, inherently lack efficiency, scalability, and privacy. Similar to parallel computing algorithms, the scalability of a blockchain-based system depends on the extent to which computational tasks can be moved off-chain. Zero knowledge techniques, such as recursive SNARKs, offer an effective means of shifting computation off-chain, requiring only proof verification as part of the consensus process. Mina demonstrates the use of these techniques in its consensus algorithm Ouroboros Samasika and zkApps. Privacy poses a challenge in blockchain systems due to their open public ledgers. However, zero knowledge proofs enable reduced data exposure on the public ledger and allow fine-tuning of the level of disclosure. Etonec's payment system serves as an exemplary application showcasing enhanced privacy in blockchains.", "description": "<tags>Mina</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 74, "code": "HKWLGR", "public_name": "Philipp Kant", "biography": "Philipp Kant is the Engineering Manager at Mina Foundation, the public benefit corporation serving the Mina Protocol. Previously, he worked at IOHK as the Head of Engineering for five years where he studied theoretical physics and software engineering. Philipp brings a passion for building high-quality, decentralized software to his role at Mina Foundation.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 65, "guid": "1826b7cd-4059-56f9-a3b7-3cf59cf2749c", "logo": "/media/protocol-berg/submissions/GSUARP/hq-my-edit-light-small-MAIN-SMALLER_rRN5Bbv.jpg", "date": "2023-09-15T16:00:00+02:00", "start": "16:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-65-whisk-returning-privacy-to-ethereum-proposers", "url": "https://speak.protocol.berlin/protocol-berg/talk/GSUARP/", "title": "Whisk: returning privacy to Ethereum proposers", "subtitle": "", "track": "Consensus", "type": "Presentation: Standard", "language": "en", "abstract": "Proposal for Whisk: a privacy-preserving protocol for electing block proposers on the Ethereum beacon chain designed by George Kadianakis", "description": "The beacon chain currently elects the next 32 block proposers at the beginning of each epoch. The results of this election are public and everyone gets to learn the identity of those future block proposers. This information leak enables attackers to launch DoS attacks against each proposer sequentially in an attempt to disable Ethereum. To fix this issue a SSLE strategy is proposed. Whisk is a privacy-preserving protocol for electing block proposers on the Ethereum beacon chain designed by George Kadianakis.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 76, "code": "ZCLJY8", "public_name": "dapplion", "biography": "Eth2.0 core dev at Lodestar @chainsafeth | merge coordinator @gnosischain | og dev at @dappnode", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 109, "guid": "afca8a67-8158-55ea-afec-c9eba5e961f4", "logo": "/media/protocol-berg/submissions/HDJFBS/dennis-trautwein-bw-square_TU8aRwm.jpeg", "date": "2023-09-15T16:30:00+02:00", "start": "16:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-109-the-best-of-both-worlds-exploring-the-role-of-centralisation-in-ipfs", "url": "https://speak.protocol.berlin/protocol-berg/talk/HDJFBS/", "title": "The Best of Both Worlds: Exploring the Role of Centralisation in IPFS", "subtitle": "", "track": "Infrastructure", "type": "Presentation: Standard", "language": "en", "abstract": "Web centralization and consolidation have created potential single points of failure, e.g., in areas such as content hosting, name resolution, and certification. The \"Decentralized Web,\" led by open-source software implementations, attempts to build decentralized alternatives. The InterPlanetary File System (IPFS) is part of this effort and provides a fully decentralized object storage and retrieval layer. This comes with challenges, though: Decentralization can increase complexity and overhead, as well as compromise performance, scalability, and system stability. As the lead developers of IPFS, we have therefore begun to explore more hybrid approaches. In this talk, we will discuss the trade-offs, and our implemented and proposed solutions, as well as give an outlook.", "description": "<tags>IPFS</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 122, "code": "VWRBVW", "public_name": "Dennis Trautwein", "biography": "Dennis is Research Engineer @ProbeLab within Protocol Labs. He works on measuring the performance of Web3 network protocols, benchmarking protocols against their target performance milestones, and proposing improvements to their core design principles.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 31, "guid": "00acf404-2f90-5fe2-b34e-e5c90854b0ac", "logo": "/media/protocol-berg/submissions/SVEZNC/Screenshot_2023-05-25_at_11.08.18_kOMXKRR.png", "date": "2023-09-15T17:00:00+02:00", "start": "17:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-31-indexing-the-planet-for-good", "url": "https://speak.protocol.berlin/protocol-berg/talk/SVEZNC/", "title": "Indexing the Planet For Good", "subtitle": "", "track": "Networking", "type": "Presentation: Standard", "language": "en", "abstract": "Immutable and verifiable content plays a key role in shaping the future of knowledge sharing for the good of all. At the same time, content represented in such a way amplifies the importance of routing; hashes are hard to remember, content keeps increasing, data moves and so do peers. This begs the question: how would we find “stuff” fast, efficiently and reliably without enabling centralised snooping? Find out what the InterPlanetary Network Indexer is addressing this issue for IPFS and FileCoin network.", "description": "While the benefits of immutable content are undeniable, a key challenge lies in efficient and reliable routing. With content increasing exponentially and data constantly in motion, the need for fast and secure discovery becomes crucial. But how can we achieve this without compromising privacy and falling into centralized surveillance?\r\n\r\nIn this talk, we will explore IPNI (InterPlanetary Network Indexer) as a solution to address these challenges head-on. We will begin by understanding the role of immutability in shaping the future of the web and why it is crucial for the integrity of content. Recognizing the need to reduce barriers for adoption, we will delve into the strategies employed by IPNI to simplify the process without compromising privacy or enabling centralized snooping akin to analytics platforms of today.\r\n\r\nWe will discuss [cid.contact](http://cid.contact) as one of the largest IPNI instances to date, and discover how it serves as a robust and efficient content router, facilitating fast and reliable content discovery. We will also address the challenges associated with decentralization and consistency, privacy preservation, access control, \"just-in-time\" caching and replication.\r\n\r\nLooking towards the future, we will explore both the near-term goals and long-term horizon for IPNI and content routing. The near-term objectives will emphasize the acceleration of adoption, leveraging the groundwork already laid. Simultaneously, we will examine alternative solutions on the horizon that have the potential to complement or challenge the existing paradigm.\r\n\r\nJoin me on this journey as we unravel the complexities of content, routing, immutability, and adoption, and discover how IPNI is contributing to a better web for all.\r\n<tags>IPFS</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 43, "code": "VSLVXV", "public_name": "Masih Derkani", "biography": "Masih Derkani is a computer scientist and software engineer with a passion for building decentralized systems. He received his PhD in Computer Science from the University of St. Andrews, where his research focused on the intersection of distributed systems and key-based routing in peer-to-peer networks. Masih is a core contributor to the InterPlanetary File System (IPFS), the InterPlanetary Network Indexer (IPNI), and Filecoin decentralized storage network. Throughout his career, he has worked on numerous other decentralized projects with a focus on large-scale data-intensive systems and high availability. Masih is dedicated to advancing the development of decentralized web and has a proven track record of delivering innovative solutions to complex problems in this space.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 62, "guid": "33f4ca52-a5ea-5e6b-a96c-3002e1ab9b18", "logo": "", "date": "2023-09-15T17:30:00+02:00", "start": "17:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-62-operation-level-concurrent-transaction-execution-for-ethereum", "url": "https://speak.protocol.berlin/protocol-berg/talk/P77CEP/", "title": "Operation-level Concurrent Transaction Execution for Ethereum", "subtitle": "", "track": "Infrastructure", "type": "Presentation: Standard", "language": "en", "abstract": "Despite the success in various scenarios, blockchain systems, especially EVM-compatible ones that serially execute transactions, still face the significant challenge of limited throughput. Concurrent transaction execution is a promising technique to accelerate transaction processing and increase the overall throughput. Existing concurrency control algorithms, however, fail to obtain enough speedups in real-world blockchains due to the high-contention workloads.\r\n\r\nIn this talk, I will propose a novel operation-level concurrency control algorithm designed for blockchains.\r\nThe core idea behind our algorithm is that only operations depending on conflicts should be executed serially, while all other conflict-free operations can be executed concurrently. Therefore, in contrast to the traditional approaches, which block or abort the entire transaction when encountering conflicts, our algorithm introduces a redo phase to resolve conflicts at the operation level by re-executing conflicting operations only. We also develop a set of data dependency tracking mechanisms to achieve precise identification and speedy re-execution for conflicting operations. We implement a prototype named ParallelEVM based on Go Ethereum and evaluate ParallelEVM using real-world Ethereum blocks. The evaluation results show that ParallelEVM achieves an average speedup of 4.28×. If combined with state prefetching techniques, ParallelEVM can further accelerate the transaction execution by 7.11×.", "description": "<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 73, "code": "3KSM8C", "public_name": "Yajin (Andy) Zhou", "biography": "My name is Yajin Zhou. I am a ZJU 100-Young professor (since 2018), with the College of Computer Science and Technology at Zhejiang University. I earned my Ph.D. (2015) in Computer Science from North Carolina State University. I am the co-founder of BlockSec, a startup dedicated to building blockchain security infrastructure.\r\n\r\nI have published more than 50 papers, with 8500+ citations (Google Scholar). One of my papers has been selected to the list of normalized Top-100 security papers since 1981. I was recognized as the Most Influential Scholar Award for my contributions to the field of Security and Privacy.\r\n\r\nMy current research spans traditional ones (software security, operating systems security and hardware-assisted security) and emerging areas (security of smart contracts, decentralized finance (DeFi) security, and the underground economy.)\r\n\r\nI have served on the program committee for multiple prestigious security conferences and as a reviewer for National Research Foundation Singapore and ANR (Agence Nationale de Recherche).", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 139, "guid": "02169927-70c1-5c5c-86e3-ac397f03e85e", "logo": "", "date": "2023-09-15T18:00:00+02:00", "start": "18:00", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-139-beyond-indexers-trustless-application-data-snapshots", "url": "https://speak.protocol.berlin/protocol-berg/talk/H73PFK/", "title": "beyond indexers: trustless application data snapshots", "subtitle": "", "track": "Infrastructure", "type": "Presentation: Standard", "language": "en", "abstract": "I will present a trustless application data snapshot architecture based on on-chain hashed lists. I will also demonstrate an implementation of that architecture that is used by HOPR mix nodes to sync data much faster and with very few on-chain reads. The proposed mechanism is an orders of magnitude improvement in indexing speed at the cost of one on-chain hash + read + write of a single storage slot. Our open source base contract can be easily integrated into other smart contracts and combined with various frontend libraries.", "description": "", "recording_license": "", "do_not_record": false, "persons": [{"id": 155, "code": "GFTHRQ", "public_name": "Sebastian Buergel", "biography": "Sebastian Bürgel builds technical solutions that empower the individual. As founder of the private data exchange infrastructure HOPR, he contributes to establishing full stack privacy for the web3. He also co-founded two other technology startups: Validity Labs (blockchain education & services) and Sonect (fintech). Sebastian holds a Ph.D degree in Microtechnology from Swiss Federal Institute of Technology, ETH Zurich.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 60, "guid": "5be9660e-0b4e-5e06-b166-847c65dbd61e", "logo": "", "date": "2023-09-15T18:30:00+02:00", "start": "18:30", "duration": "00:25", "room": "Atelier - Side Stage", "slug": "protocol-berg-60-worldcoin-maximally-private-digital-identity-", "url": "https://speak.protocol.berlin/protocol-berg/talk/CHPGAZ/", "title": "Worldcoin: Maximally private digital identity.", "subtitle": "", "track": "Cryptography", "type": "Presentation: Standard", "language": "en", "abstract": "With over 2M members Worldcoin has the largest anonymity set for its zero knowledge proof of personhood protocol.", "description": "The talk will be about  ZK Magic and technical aspects. ZKP was first used by ZCash to create transactional privacy (something we still don't have in Ethereum). Then we got distracted by the scaling problem and started developing ZKRollups. We now even have ZKEVMs. All of these require massive proving servers, and that has been the focus of ZKP development.\r\n\r\nBut we still need privacy, and for that we need small fast provers that users can run themselves. And it needs to run in the wallets. i.e. in the browser and on their phones. This creates a set of challenges very different from the ones you find in ZKRollups. There are a number of developments, tricks, and research areas that can help devs bring privacy to the users and I will be talking about those.\r\n\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 70, "code": "9SF8VH", "public_name": "Remco Bloemen", "biography": "Decentralization and cryptography nerd since forever. Currently leading design of self-sovereign private digital identity at Worldcoin.", "answers": []}], "links": [], "attachments": [], "answers": []}], "Loft - Workshop 0": [{"id": 16, "guid": "92f764f5-2a94-5b2d-92ad-b10d5a177df6", "logo": "", "date": "2023-09-15T10:00:00+02:00", "start": "10:00", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-16-cometbft-the-shooting-star-of-blockchain-consensus-protocols", "url": "https://speak.protocol.berlin/protocol-berg/talk/ALAJDQ/", "title": "CometBFT: The Shooting Star of Blockchain Consensus Protocols", "subtitle": "", "track": "Consensus", "type": "Workshop: Educational", "language": "en", "abstract": "Ali will introduce CometBFT and discuss the unique features that set it apart from other blockchain protocols. You will find out why CometBFT is quickly becoming the preferred choice for decentralized applications and how it is addressing the scalability challenges in blockchain technology.\r\n\r\nDuring the presentation, Ali will take a deep dive into the technical details of CometBFT. You will learn about its code and architecture, and explore the cryptographic primitives that keep it secure. This part of the presentation will be especially interesting for developers and blockchain enthusiasts who want to understand the inner workings of CometBFT.\r\n\r\nFurthermore, Ali will discuss how CometBFT is contributing to the realization of decentralization in the blockchain industry. You will find out how CometBFT is enabling decentralized applications to thrive and empowering individuals to take control of their data and assets.\r\n\r\nFinally, Ali will also introduce ABCI++, its features, and its potential impact on the blockchain industry. This presentation is a must-attend for anyone interested in the latest advancements in blockchain technology.", "description": "<tags>Cosmos</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 18, "code": "NC7XWJ", "public_name": "Aliasgar Merchant", "biography": "Aliasgar a Blockchain aficionado, has over five years of experience in the field of web3. He first dipped his toes into the blockchain world in 2017 with Ethereum smart contract development, before moving to the cosmos ecosystem in 2019.\r\n\r\nCurrently, Aliasgar's serving as a Developer Relations Engineer at Informal Systems, where he works on CometBFT, a fork of the Tendermint consensus algorithm that powers Cosmos SDK and other Cosmos Blockchain networks.\r\n\r\nAs a developer who's worked with leading blockchain projects like Sifchain, Tendermint Inc, and Akash, Aliasgar has proven himself to be a true Cosmos cowboy. \r\n\r\nIn his current role, Aliasgar focuses on building relationships with fellow developers, community leaders, and businesses to help drive the adoption of CometBFT and the Cosmos ecosystem. With his passion for emerging technologies and deep understanding of the blockchain landscape, he's constantly pushing the limits of what's possible in this exciting field.\r\n\r\nIn short, if you're looking to explore the blockchain universe and boldly go where no developer has gone before, Aliasgar is your guy. Connect with him today and join forces to create innovative solutions that will shape the future of the blockchain galaxy.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 113, "guid": "4e87fe20-6bbf-5627-9042-97c475daab1c", "logo": "/media/protocol-berg/submissions/MQMWLG/radicle-ascii_YvrEFqZ.png", "date": "2023-09-15T10:45:00+02:00", "start": "10:45", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-113-peer-to-peer-code-collaboration-with-radicle", "url": "https://speak.protocol.berlin/protocol-berg/talk/MQMWLG/", "title": "Peer-to-peer code collaboration with Radicle", "subtitle": "", "track": "Networking", "type": "Workshop: Educational", "language": "en", "abstract": "In this hands-on workshop, we’ll learn how to use the Radicle stack to collaborate on a code project. We’ll run our own nodes, connect to peers, and grow a virtual garden together.", "description": "Radicle is a local-first, peer-to-peer network for code collaboration, built on top of Git. It enables users to run their own nodes, ensuring censorship-resistant code collaboration and fostering a resilient network without reliance on third-parties.\r\n\r\nRadicle functions as a protocol where each user on the network runs identical software, known as the Radicle Stack. This stack primarily consists of a command line interface and a networked service called the Radicle Node.\r\n\r\nUsers can also opt to run the Radicle Web client and HTTP daemon, providing a familiar web-based experience for enhanced accessibility and convenience.\r\n\r\nIn this workshop we will explore Radicle's code collaboration workflow by:\r\n- running our own Radicle Node\r\n- using the Radicle Web client & Radicle CLI\r\n- connecting to a community seed node\r\n\r\nRequirements:\r\n- Device running Linux or MacOS\r\n\r\nWebsite:\r\n- https://radicle.xyz\r\n<tags>Radicle</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 99, "code": "ZAN39X", "public_name": "Erik Kundt", "biography": "Erik (he/they) works as a freelance artist and developer with a focus on audio / visual coding and decentralized technologies.\r\n\r\nHe has worked in the area of professional music production for Native Instruments, and later on the Solidity programming language for the Ethereum Foundation. Besides these occupations, he has directed several dance, performance and documentary theater projects in their own technical fields, such as video production and mapping, VR / AR and AI.\r\n\r\nAt the moment he is mainly contributing to the Radicle stack and building tools for generative artists.", "answers": []}, {"id": 129, "code": "MEY8AM", "public_name": "Sebastian Martinez", "biography": "Sebastian Martinez, a mechanical engineer turned to the web, is currently contributing to the future of code collaboration at Radicle. Drawing on his unique experience implementing proof-of-existence solutions in the nuclear industry.\r\n\r\nFrom his roots in Switzerland and a personal discovery in Argentina, Sebastian's journey has shaped him into a passionate tech professional and dedicated father of two, poised to make a significant impact in the technology sphere.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 84, "guid": "4e8061b0-0850-5e60-8ec6-fb5d6ed80641", "logo": "/media/protocol-berg/submissions/LVZAEY/Screenshot_2023-08-03_at_2.01.09_PM_AmsoOzF.png", "date": "2023-09-15T11:30:00+02:00", "start": "11:30", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-84-emerging-interfaces-for-building-web3-applications", "url": "https://speak.protocol.berlin/protocol-berg/talk/LVZAEY/", "title": "Emerging interfaces for building web3 applications", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Educational", "language": "en", "abstract": "New programable interfaces are emerging from the application space being created by specialized app-chains. In this workshop, we’ll discover what these are on Polkadot and how they’re evolving the landscape of developing multi-chain decentralized applications.", "description": "Engineering appchain logic is a key enabler for a rich web3 application space, whereby appchains can compose new services using the services offered by other chains. This educational workshop is a good starting point for anyone looking to understand the underpinnings of Polkadot's emerging application space. We'll learn about Polkadot appchains, how to extend their logic to adopt cross-chain protocols and take a dive into what this all might enable for our workshops protagonist and end-user, Mum.", "recording_license": "", "do_not_record": false, "persons": [{"id": 97, "code": "LWWUSN", "public_name": "Sacha", "biography": "Sacha is a developer advocate at Parity Technologies, on a mission to bring forward Polkadot’s technologies to builders of web3. When he’s not working on workshops, documentation or contributing to web3 projects, you may find him walking around somewhere on earth or playing guitar.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 116, "guid": "88e46638-d827-5ed8-afcf-df66f2d02d66", "logo": "", "date": "2023-09-15T12:15:00+02:00", "start": "12:15", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-116-developer-tooling-education-and-funding", "url": "https://speak.protocol.berlin/protocol-berg/talk/9ZBX3L/", "title": "Developer Tooling, Education, and Funding", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Educational", "language": "en", "abstract": "Modern decentralized app stack, ethereum dev eduction, and streaming developer UBI.", "description": "Scaffold-eth-2 is a modern dapp stack and I'll demo how to get started shipping.\r\nSpeedRunEthereum.com is an educational journey for developers learning web3.\r\nBuidlGuidl DAO is streaming ETH to developers as UBI using special cohort streams.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 128, "code": "ZDYNY8", "public_name": "austingriffith", "biography": "🔥🫡🔥 builder on Ethereum 🛠", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 6, "guid": "0d0f4bd1-f934-5f23-8f0f-e18717e42eff", "logo": "", "date": "2023-09-15T13:30:00+02:00", "start": "13:30", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-6-essential-maths-for-zero-knowledge-proofs", "url": "https://speak.protocol.berlin/protocol-berg/talk/DXBMVB/", "title": "Essential Maths for Zero Knowledge Proofs", "subtitle": "", "track": "Cryptography", "type": "Workshop: Educational", "language": "en", "abstract": "A workshop explaining the essential maths needed to understand zero knowledge proofs", "description": "his interactive workshop will go through the maths needed for  zero knowledge proof creation and verification. \r\nIt will cover\r\n- Background cryptography / number theory\r\n- Polynomial theory\r\n- Commitment Schemes\r\n- A run through of the zkSNARK and zkSTARK process\r\n- Optimisation techniques used in popular protocols", "recording_license": "", "do_not_record": false, "persons": [{"id": 6, "code": "SJDYHJ", "public_name": "Laurence Kirk", "biography": "I am an educator and developer in the Web3 space, with a particular passion for zero knowledge proofs.\r\nI started following blockchain tech in 2011, started working on Ethereum in 2015 and started running workshops in 2017. \r\nCurrently as CEO of Extropy.IO I teach workshops about zero knowledge proofs and advanced solidity.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 97, "guid": "5cf53749-6a14-5f93-b8c3-5a9e5fe367e6", "logo": "", "date": "2023-09-15T14:15:00+02:00", "start": "14:15", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-97-the-problem-of-historical-data-availability-in-evm-chains", "url": "https://speak.protocol.berlin/protocol-berg/talk/CCYAET/", "title": "The problem of historical data availability in EVM chains", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Educational", "language": "en", "abstract": "This presentation will try to explain what the problem of historical data availability is in EVM chains, why it exists and how we can try to tackle it.", "description": "Given an ethereum address, get all transactions involving it. Such a simple and fundamental thing to ask, though all EVM chains and other EVM inspired chains clients simply can't answer this easily.\r\n\r\nThe way the node client is built it's unable to provide this answer which has given raise to a host of problems as new protocols and indexing services arise to fill in the gap. As ethereum protocol development enters its 10th year the problem seems to be ignored and sweeped under the rug, such as with the removal of archive nodes.\r\n\r\nAll the above leads to a very unfortunate centralization of what was supposed to be a decentralized protocol. In the talk we will try to analyze the problem, some existing solutions and approaches and how we can do better so that ethereum can go into the next 100 years and have historical data available.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 111, "code": "M9SRRS", "public_name": "Lefteris Karapetsas", "biography": "Ethereum developer since 2014! Contributed to the solidity compiler and C++ ethereum. Built the DAO, saw it get destroyed, then hacked it back to save whatever we could both in ETH and ETC. Development lead for the Raiden network. Founder of rotki. I like birding :D", "answers": []}, {"id": 165, "code": "EM9DLK", "public_name": "Yabir Garcia", "biography": "Backend developer for rotki. Background on mathematics and CS", "answers": []}, {"id": 166, "code": "QAKTGL", "public_name": "Konstantinos Paparas", "biography": "Open-source engineer\r\nFrontend lead/Infra @ rotki", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 69, "guid": "fe477b62-ec53-531a-98bd-f419cc3bcb46", "logo": "", "date": "2023-09-15T15:00:00+02:00", "start": "15:00", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-69-ephemery-disposable-public-testnet", "url": "https://speak.protocol.berlin/protocol-berg/talk/LNDDWQ/", "title": "Ephemery: Disposable public testnet", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Educational", "language": "en", "abstract": "Introduction to Ephemery, a novel approach to testnets which enables a single testing infrastructure consisting of ephemeral networks with deterministic parameters.", "description": "Ephemery is an automatically reset testnet with each network iteration is created by a specified function which deterministically generates new genesis states. This kind of testnet can provide an alternative environment for short-term testing of applications, validators and also breaking changes in client implementations. It avoids issues of long running testnets which suffer from state bloat, lack of testnet funds or consensus issues. Periodically resetting the network back to genesis cleans the validator set, returns funds back to faucets while keeping the network reasonably small for easy bootstraping.\r\n\r\nTest your applications, validators, client implementations or contribute to the testnet at ephemery.dev.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 82, "code": "SBPW3Z", "public_name": "Mario Havel", "biography": "Protocol Supporter, founder of Bordel", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 71, "guid": "f1d88d0d-ec34-5ca1-a307-836481c76a1b", "logo": "/media/protocol-berg/submissions/VCNBNY/photo_2022-06-13_15-50-21_KR9yqiP.jpg", "date": "2023-09-15T15:45:00+02:00", "start": "15:45", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-71-the-holeky-testnet-launch-hangout", "url": "https://speak.protocol.berlin/protocol-berg/talk/VCNBNY/", "title": "The Holešky Testnet Launch Hangout", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Educational", "language": "en", "abstract": "Coincidentally, the Holešky testnet is scheduled to launch during the Protocol Berg conference. Let's put it on screen and chat about testnet infrastructure.", "description": "The first long-standing, merged-from-genesis, public Ethereum testnet. Holešky will replace Goerli as a staking, infrastructure and protocol-developer testnet in 2023.\r\n\r\nhttps://github.com/eth-clients/holesky\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 3, "code": "HHCRB3", "public_name": "Afri Schoedon", "biography": "Head of Protocol Engineering at ChainSafe Systems. Core-Organizer ETHBerlin, Protocol Berg, and GoerliCon. Running testnets on the side.", "answers": []}, {"id": 34, "code": "33WYMV", "public_name": "Parithosh", "biography": "I am an Ethereum enthusiast with a deep love for all things servers. I incorporated Ethereum into my Master’s thesis and loved the experience so much as to make it my full time job. I currently work in the DevOps team of the Ethereum Foundation and I mainly focus on the Ethereum protocol upgrades. I’m also an avid photographer with a specific interest in Landscape and Travel photography.", "answers": []}, {"id": 35, "code": "Y3XUEK", "public_name": "Barnabas Busa", "biography": "Devops at Ethereum Foundation", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 128, "guid": "d6ef6af9-9b9e-558e-9c42-3f595a94974b", "logo": "/media/protocol-berg/submissions/UUEBRR/Screenshot_2023-06-29_at_09.24.44_5zAL7BM.png", "date": "2023-09-15T16:30:00+02:00", "start": "16:30", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-128-running-rollups-on-light-nodes", "url": "https://speak.protocol.berlin/protocol-berg/talk/UUEBRR/", "title": "Running rollups on light nodes", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Educational", "language": "en", "abstract": "Learn how to run rollup software on a data availability sampling light node.", "description": "<tags>Celestia</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 145, "code": "XACBLA", "public_name": "rene", "biography": "data availability @ celestia", "answers": []}, {"id": 179, "code": "USVVV7", "public_name": "NashQ", "biography": "Research Engineer at Celestia and Team Lead at Rollkit", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 125, "guid": "a659b26b-14cd-54da-9dcf-bc75100d72d5", "logo": "/media/protocol-berg/submissions/QQ3H9F/DSCF5344_wL9r7Kx.JPG", "date": "2023-09-15T17:15:00+02:00", "start": "17:15", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-125-the-forest-that-protects-the-public-good-nym-mixnet-for-libp2p-privacy", "url": "https://speak.protocol.berlin/protocol-berg/talk/QQ3H9F/", "title": "The Forest That Protects the Public Good: Nym mixnet for Libp2p privacy", "subtitle": "", "track": "Networking", "type": "Workshop: Educational", "language": "en", "abstract": "The public and private are not opposites, they are complementary: privacy is needed to sustain the security and integrity of people as well as infrastructure that serve the public good. This workshop will demo working code for running Libp2p traffic through the Nym mixnet, built with the Nym Rust SDK.", "description": "The public and private are not opposites, they are complementary: privacy is needed to sustain the security and integrity of people as well as infrastructure that serve the public good. This workshop presents the cypherpunk principle for understanding the public and private, namely “transparency for the powerful, privacy for the rest of us” - showing how to operationalise this in the context of decentralised infrastructures. The workshop presents the Nym mixnet as a privacy commons for libp2p, a core module for decentralised networking, used by Ethereum consensus clients and beyond. Recently, Chainsafe built a proof of concept integration of Nym for Lighthouse. This workshop will demo working code for running Libp2p traffic through the Nym mixnet, built with the Nym Rust SDK.\r\n\r\nDistributed infrastructures suffer from a common vulnerability: that traffic is exposed, can reveal IP addresses and be used to deanonymise operators. This puts both operator as well as nodes at risk of DDoS attacks as well as censorship. Mixnets function like a forest surrounding and sustaining the public goods of such core modules: they encrypt and mix network traffic across several layers of mix nodes, adding small time delays - a leafy canopy to obscure the patterns of communication that might otherwise reveal sensitive network information.\r\n<tags>Nym</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 141, "code": "J9JLB3", "public_name": "Jaya Klara Brekke", "biography": "Jaya Klara Brekke is a cryptographic geographer and CSO at Nym, a global decentralised, incentivised privacy network. She works with the Nym SDK team and broader company on researching, developing and articulating the broader societal implications and importance of privacy technologies in the current major re-architecting of digital worlds.", "answers": []}, {"id": 143, "code": "WZYRC8", "public_name": "Max Hampshire", "biography": "Senior Developer Relations for Nym, previously a researcher and artist with background in Philosophy.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 119, "guid": "f0111e4c-e254-5ddc-aee0-918c9431d41a", "logo": "/media/protocol-berg/submissions/UULLX8/screenshots_3PIlh8F.png", "date": "2023-09-15T18:00:00+02:00", "start": "18:00", "duration": "00:40", "room": "Loft - Workshop 0", "slug": "protocol-berg-119-rawsciousness-contribute-to-a-sci-fi-film-about-authenticity-in-a-post-crypto-world", "url": "https://speak.protocol.berlin/protocol-berg/talk/UULLX8/", "title": "Rawsciousness -  contribute to a sci-fi film about Authenticity in a Post-Crypto World", "subtitle": "", "track": "General", "type": "Workshop: Educational", "language": "en", "abstract": "Contribute to a sci-fi film exploring the meaning of Authenticity in a Post-Crypto World", "description": "After reflecting on their existence, Alice and Bob question why humans often communicate harmfully towards each other and nature.\r\n\r\nPart I of our film is ready. Part II needs your input. The ending hinges on your answers to their questions on authenticity and cryptography.\r\n\r\n10 minutes: Film screening\r\n10 minutes: Cryptography game to communicate with Alice and Bob\r\n20 minutes: Fishbowl discussion about the types of authenticity we might achieve as humanity\r\nOptional: stay afterwards for 1:1 interviews for the film\r\n\r\nNote: after the screening, we'll be recording for the film itself.  We'll be asking for your genuine input to questions about these issues, to be included in the film.", "recording_license": "", "do_not_record": true, "persons": [{"id": 135, "code": "9MSLPB", "public_name": "Grigoris", "biography": "Autonomously Interdependent\r\nBorn in 1973\r\nGrigoris", "answers": []}, {"id": 167, "code": "VPUQ3A", "public_name": "Salim Virani", "biography": "Buidling things that help people learn from each other.  salimvirani.com", "answers": []}], "links": [], "attachments": [], "answers": []}], "Atelier - Workshop 1": [{"id": 11, "guid": "d00817be-be6b-5682-ab26-2ca8dfc9cbb5", "logo": "", "date": "2023-09-15T11:00:00+02:00", "start": "11:00", "duration": "00:40", "room": "Atelier - Workshop 1", "slug": "protocol-berg-11-real-web3-messaging-must-be-encrypted-decentralized-and-interoperable-utilizing-dm3-protocol-as-layer-0-of-messaging-", "url": "https://speak.protocol.berlin/protocol-berg/talk/CAU9S8/", "title": "Real web3 messaging must be encrypted, decentralized, and interoperable! Utilizing dm3 protocol as layer 0 of messaging.", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Educational", "language": "en", "abstract": "The dm3 protocol is the web3 messaging protocol focusing on encryption, decentralization, scalability, and in particular interoperability. It utilizes the essential features for a lean messaging base protocol: a registry for public keys and decentralized delivery service nodes.", "description": "Email, SMS, and messengers such as WhatsApp, Signal, Telegram, and others are known and used by almost everyone today. The lack of comprehensive end-to-end encryption for e-mail and closed data silos for central messenger services are currently common. Cross-application communication is not possible. User profiles are under the control of large corporations.\r\n\r\nWith web3 we have new possibilities like key-based identities, decentralized registries on the blockchain, and end-to-end encryption, ... In the last month, several web3-based messaging solutions were introduced. While encryption, security, and privacy are consistently implemented, interoperability is still not yet solved but is needed even more. \r\n\r\nWith **dm3**, there exists a lean web3-based protocol for peer-2-peer messaging, which makes it possible to easily integrate secure communication into DApps. Interoperability with other protocols or services can be accomplished with little effort and without compromising on security. Protocol extensions for advanced privacy, group chats, public message feeds, and more enhance the basic protocol for even more applications.\r\n\r\nThe **dm3** protocol is utilizing **ENS (Ethereum Name Service)** as a central (but decentralized) registry for communication information (like public keys for encryption and signature verification and information, how and where to deliver messages) and an open and scalable network of delivery service nodes for delivering messages or as gateways to other protocols or services.\r\n\r\nThe aim of the talk is to introduce the public good dm3 protocol, emphasize how interoperability is fundamental for web3 messaging applications and how interoperability is implemented with dm3, and show how secure and interoperable communication can be integrated into DApps.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 11, "code": "QNLULM", "public_name": "Steffen Kux", "biography": "As an applied mathematician, Steffen started his career in 2000 in the automotive industry as a method- and software developer for mathematical and simulation software, with a particular focus on applications using mathematical optimization, numerical simulation, and artificial intelligence. \r\n\r\nSince 2017, he has been working to implement blockchain technology for real-world applications. He has developed applications with industry partners and products in IoT, energy, mobility, sharing economy, asset management, and self-sovereign identity.\r\n\r\n2021 Steffen co-founded with 3 partners corpus as a venture studio for web3 applications. Now Steffen is focused on web3 messaging as one of the venture studio's successful projects. He and his team are developing dm3, the web3 messaging protocol for secure and interoperable communication.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 27, "guid": "af75eca1-4326-5e54-b269-4c68ce0e451c", "logo": "", "date": "2023-09-15T11:45:00+02:00", "start": "11:45", "duration": "01:20", "room": "Atelier - Workshop 1", "slug": "protocol-berg-27-testnet-or-not-here-we-come-a-deep-dive-into-running-test-networks", "url": "https://speak.protocol.berlin/protocol-berg/talk/SAG7F3/", "title": "Testnet or Not, Here We Come: A deep dive into running test networks", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Deep Dive", "language": "en", "abstract": "Post-Merge testnets are a beast to run, this workshop would give you an overview into all the tooling that exists to make this job easier. We would also setup a small testnet during this workshop to help familiarize with the tools.", "description": "Testnets are useful for more than Ethereum upgrades or dapps, they can be invaluable in prototyping EIPs and hunting for security issues. This workshop will deep dive into the extensive tooling we have for single host and multi host testnets, aiming to showcase our preferred options for various usecases.\r\n<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 34, "code": "33WYMV", "public_name": "Parithosh", "biography": "I am an Ethereum enthusiast with a deep love for all things servers. I incorporated Ethereum into my Master’s thesis and loved the experience so much as to make it my full time job. I currently work in the DevOps team of the Ethereum Foundation and I mainly focus on the Ethereum protocol upgrades. I’m also an avid photographer with a specific interest in Landscape and Travel photography.", "answers": []}, {"id": 35, "code": "Y3XUEK", "public_name": "Barnabas Busa", "biography": "Devops at Ethereum Foundation", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 87, "guid": "a64bc28b-db02-5924-96fe-20ca610781bf", "logo": "/media/protocol-berg/submissions/ZYZGWE/Frr-xVvXoAseR_S_JkxAklF.png", "date": "2023-09-15T15:15:00+02:00", "start": "15:15", "duration": "01:20", "room": "Atelier - Workshop 1", "slug": "protocol-berg-87-roll-your-own-crypto", "url": "https://speak.protocol.berlin/protocol-berg/talk/ZYZGWE/", "title": "Roll your own crypto", "subtitle": "", "track": "Cryptography", "type": "Workshop: Deep Dive", "language": "en", "abstract": "Elliptic curve cryptography underpins the trillion dollar economy of cryptocurrencies. But it's often seen as some sort of sorcery, meant only for experts. While it's true that cryptography is a minefield, and therefore you should _never roll your own crypto_, it's still a useful method to build an understanding of cryptocurrencies from first principles.\r\n\r\nIn this workshop, we'll cover basic algebra necessary to get a theoretical understanding of elliptic curves, and learn how they are used for signing and verifying transactions. We'll then put this theory to practice by rolling our own toy implementation of the elliptic curve used in Ethereum and Bitcoin.", "description": "We'll cover the following topics during the workshop, although not in the same order. Please note that this programme may be subject to minor changes.\r\n\r\n**Foundational stuff**\r\n* Introduction to elliptic curves\r\n* Field and group theory\r\n* Elliptic curves under the hood\r\n* Signature and verification (ECDSA)\r\n\r\n**Practical stuff**\r\n* Representing elliptic curves in code\r\n* Implementing primitives for elliptic curve operations\r\n* Implementing ECDSA\r\n\r\n**Fun stuff**\r\n* The Playstation 3 hack\r\n* Backdoors in elliptic curves (you may leave the workshop paranoid)\r\n\r\nNo prior background in cryptography is necessary, but some programming experience is recommended to fully engage in the hands-on implementation exercises. Make sure to bring pen and paper for working through the mathematical concepts, as well as a laptop configured to run Python or NodeJS code.", "recording_license": "", "do_not_record": false, "persons": [{"id": 101, "code": "8SB9KS", "public_name": "Anirudha Bose", "biography": "Anirudha is a Staff Engineer at Brave, where he works on web3 initiatives, notably the multi-chain Brave Wallet. Previously, he worked at Ledger on custody software for financial institutions, and also briefly on algorithms for quantum computers. He enjoys travelling, attending mixers, and playing the guitar.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 86, "guid": "1f903024-c2cd-5754-bae6-a50e0614bb08", "logo": "", "date": "2023-09-15T16:45:00+02:00", "start": "16:45", "duration": "00:40", "room": "Atelier - Workshop 1", "slug": "protocol-berg-86-p2p-set-reconciliation-as-storage-heavy-dapp-infrastructure-2-0", "url": "https://speak.protocol.berlin/protocol-berg/talk/DXHUGH/", "title": "p2p set reconciliation as storage-heavy dapp infrastructure 2.0", "subtitle": "", "track": "Networking", "type": "Workshop: Educational", "language": "en", "abstract": "With a set reconciliation algorithm built on js-libp2p-gossipsub and using Patricia Merkle Tries Farcaster (and Kiwi News) are pioneering a new type of credible neutral architecture for social+decentralized apps. In this talk, @timdaub will go through the architectural basics of what makes Kiwi News‘s replication algorithm work and how it uses the Ethereum mainnet for name space management and as a public key registry.", "description": "<tags>Ethereum</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 100, "code": "7Z9TBC", "public_name": "Tim Daubenschütz", "biography": "@timdaub is the founder of Kiwi News, a decentralized Hacker News clone that no single entity controls but everybody co-owns.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 20, "guid": "4d57bbd8-83fc-55bb-8c49-7c02ea3eab15", "logo": "", "date": "2023-09-15T17:30:00+02:00", "start": "17:30", "duration": "01:20", "room": "Atelier - Workshop 1", "slug": "protocol-berg-20-crossing-the-interoperability-bridge-a-deep-dive-into-building-interoperable-dapps-with-ibc", "url": "https://speak.protocol.berlin/protocol-berg/talk/WMQHKH/", "title": "Crossing the Interoperability Bridge: A Deep Dive into Building Interoperable dApps with IBC", "subtitle": "", "track": "Infrastructure", "type": "Workshop: Deep Dive", "language": "en", "abstract": "This workshop will be led by Federico Kunze Küllmer, who was part of the core team that developed the Inter Blockchain Communication Protocol (IBC). Federico is also the co-founder of Evmos, an EVM compatible blockchain that supports interoperable dApps via IBC. Federico will dive deep into the technical aspects of the IBC protocol, exploring how it enables cross-chain communication and discussing how Evmos simplifies the development of interoperable dApps. Attendees will have the opportunity to learn from the speaker's firsthand experience in implementing the IBC protocol and gain valuable insights into developing successful interoperable dApps using Solidity.", "description": "Join us for a comprehensive workshop on writing interoperable decentralized applications using the Ethereum Virtual Machine (EVM) and the Inter Blockchain Communication Protocol (IBC). This deep dive session will explore the key architectural components that enable interoperability between dApps, including a detailed deep dive of the EVM and IBC. The workshop will conclude with a hands-on demo, giving participants the opportunity to develop their own interoperable dApps using Solidity. This is an ideal opportunity for engineers looking to advance their dApp development skills and gain practical experience in the emerging field of blockchain interoperability.\r\n<tags>Cosmos</tags>", "recording_license": "", "do_not_record": false, "persons": [{"id": 25, "code": "NUWLD7", "public_name": "Federico Kunze Küllmer", "biography": "Evmos Co-founder. Cosmos Core Contributor. IBC Core Engineer.", "answers": []}, {"id": 28, "code": "Q9SUGB", "public_name": "Daniel Burckhardt", "biography": "-", "answers": []}], "links": [], "attachments": [], "answers": []}]}}]}}}